---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtype
source: html/d5fea530-a81d-70a7-311e-9a4ae7a52051.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtype Property

"IFC Predefined Type"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportPredefinedtype { get; }
```